org/comsys/index.org
#+TITLE: Kommunikationssysteme
#+STARTUP: content
#+STARTUP: latexpreview
#+STARTUP: inlineimages
#+OPTIONS: toc:nil
#+BEGIN_HTML
---
layout: page
title: Kommunikationssysteme
---
#+END_HTML

* Inhalt

- Allgemeines
  - [[./service][Dienst]]
  - [[./protocol.org][Protokoll]]
  - [[./networkarchitecture.org][Netzwerkarchitektur]]
  - [[./networks.org][Netzwerke]]
  - [[./routing.org][Routing und Forwarding]]
  - [[./qos.org][Quality of Service]]
  - [[./standards.org][Standards]]
  - [[./uri.org][Uniform Resource Identifier]]
- Netzwerkarchitekturen
  - [[./iso_osi_rm.org][ISO/OSI Referenzmodell]]
  - [[./internet.org][Internet]]
- Schichten
  - [[./data_link_layer.org][Data Link Layer]]
- Routing
  - [[./as.org][Autonome Systeme]]
- spezielle Protokolle
  - [[./arp.org][ARP]]
  - [[./rarp.org][Reverse ARP]]
  - [[./dhcp.org][DHCP]]
  - [[./ipv4.org][IPv4]]
  - [[./icmp.org][ICMP]]
  - [[./ipv6.org][IPv6]]
  - [[./icmpv6.org][ICMPv6]]
  - [[./tcp.org][TCP]]
  - [[./udp.org][UDP]]
  - [[./ethernet.org][Ethernet]]
- Netzwerktools
  - [[./hping.org][hping]]
  - [[./wireshark.org][Wireshark]]
  - [[./traceroute.org][traceroute]]
- [[./klausurthemen.org][Klausurthemen]]


* Begriffe

*Bandbreite*: Frequenzspektrum eines Übertragungskanals. Z.B. ergeben
 sich für WLAN mit einer Trägerfrequenz von 2400 MHz und einer
 Bandbreite von 20 - 40 MHz folgende Kanäle:

#+CAPTION: Bsp. für Kanäle bei einer Trägerfrequenz von 2,4 GHz und einer Bandbreite von 20 - 40 MHz
|         | Bandbreite      |
|---------+-----------------|
| Kanal 1 | 2400 - 2440 MHz |
| Kanal 2 | 2440 - 2480 MHz |
| ...     | ...             |

*Server:* Ein Server ist eine Software, die bestimmte Dienste anbietet.

*Dienst*: s. [[./service.org][Dienst]]

*Protokoll*: s. [[./protocol.org][Protokoll]]

*triple play:* Dienste, die in Deutschland über die Telefonsteckdose
angeboten werden: Telefonie, Internetzugang, Fernsehen

*ISO*: International Organization for Standardization

*OSI*: Open System Interconnection

*ISDN*: Integrated Services Digital Network

*GSM*: Global System for Mobile Communication

*PSTN*: Public Switched Telephone Network

*TCP*: Tranmission Control Protocol

*UDP:* User Datagram Protocol

*Netzwerkarchitektur:* Ein System aus Schichten und Protokollen heißt
/Netzwerkarchitektur/. Das OSI-Referenzmodell ist eine
Netzwerkarchitektur.

*Protocol stack:* Die Liste von Protokollen (ein Protokoll pro
Schicht!), die von /einem/ System genutzt wird nennt man /protocl
stack/.

*MAC*: Medium Access Control

*ICT*: Information and Communication Technology

*Routing*: Als /Routing/ bezeichnet man das Finden einer optimalen Route
zum Transport von Paketen zwischen End-Systemen. Routing funktioniert
über die Erstelleung und kontinuierliche Aktualisierung der *routing
tables* mit *next hop* Einträgen in Transit- und Endsystemen.

*ISP:* Internet Service Provider

*Network Adress Translateion* (NAT): Network Adresstranslation findet
statt, wenn Pakete über Netzwerkgrenzen hinaus transportiert werden.
Z.B., wenn Pakete aus einem privaten Netzwerk (10.*.*.*) in ein
öffentliches Netzwerk transportiert werden. Systeme, die NAT
ausführen, werden im Allgmeinen als /Router/ bezeichnet.

*Forwarding:* Forwarding bezeichnet das Weiterleiten von Paketen in
Transitsystemen mit Hilfe von *forwarding tables*

*Maximum Transmission Unit* (MTU): maximale Größe einer
 Übertragungseinheit (packet, frame, sequence, etc.)

*Internet Assigned Number Authority* (IANA): Die IANA verwaltete den
globalen Pool von IP-Adressen und AS Nummern und vergibt
IP-Adressblöcke an RIRs.

*Regional Internet Registrars* (RIRs): verwalten IP-Adressen und AS
Nummern in ihrer Region. Die RIRs sind: /AfriNIC/ (Afrika), /APNIC/
(Asien/Pazifik), /ARIN/ (Nordamerika), /LACNIC/ (Lateinamerika, Karibik),
/RIPE NCC/ (Europa).


