comsys/index.html
---
layout: page
title: Kommunikationssysteme
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Inhalt</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Allgemeines
<ul class="org-ul">
<li><a href="./service">Dienst</a>
</li>
<li><a href="./protocol.html">Protokoll</a>
</li>
<li><a href="./networkarchitecture.html">Netzwerkarchitektur</a>
</li>
<li><a href="./networks.html">Netzwerke</a>
</li>
<li><a href="./routing.html">Routing und Forwarding</a>
</li>
<li><a href="./qos.html">Quality of Service</a>
</li>
<li><a href="./standards.html">Standards</a>
</li>
<li><a href="./uri.html">Uniform Resource Identifier</a>
</li>
</ul>
</li>
<li>Netzwerkarchitekturen
<ul class="org-ul">
<li><a href="./iso_osi_rm.html">ISO/OSI Referenzmodell</a>
</li>
<li><a href="./internet.html">Internet</a>
</li>
</ul>
</li>
<li>Schichten
<ul class="org-ul">
<li><a href="./data_link_layer.html">Data Link Layer</a>
</li>
</ul>
</li>
<li>Routing
<ul class="org-ul">
<li><a href="./as.html">Autonome Systeme</a>
</li>
</ul>
</li>
<li>spezielle Protokolle
<ul class="org-ul">
<li><a href="./arp.html">ARP</a>
</li>
<li><a href="./rarp.html">Reverse ARP</a>
</li>
<li><a href="./dhcp.html">DHCP</a>
</li>
<li><a href="./ipv4.html">IPv4</a>
</li>
<li><a href="./icmp.html">ICMP</a>
</li>
<li><a href="./ipv6.html">IPv6</a>
</li>
<li><a href="./icmpv6.html">ICMPv6</a>
</li>
<li><a href="./tcp.html">TCP</a>
</li>
<li><a href="./udp.html">UDP</a>
</li>
<li><a href="./ethernet.html">Ethernet</a>
</li>
</ul>
</li>
<li>Netzwerktools
<ul class="org-ul">
<li><a href="./hping.html">hping</a>
</li>
<li><a href="./wireshark.html">Wireshark</a>
</li>
<li><a href="./traceroute.html">traceroute</a>
</li>
</ul>
</li>
<li><a href="./klausurthemen.html">Klausurthemen</a>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Begriffe</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Bandbreite</b>: Frequenzspektrum eines Übertragungskanals. Z.B. ergeben
 sich für WLAN mit einer Trägerfrequenz von 2400 MHz und einer
 Bandbreite von 20 - 40 MHz folgende Kanäle:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Bsp. für Kanäle bei einer Trägerfrequenz von 2,4 GHz und einer Bandbreite von 20 - 40 MHz</caption>

<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Bandbreite</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Kanal 1</td>
<td class="left">2400 - 2440 MHz</td>
</tr>

<tr>
<td class="left">Kanal 2</td>
<td class="left">2440 - 2480 MHz</td>
</tr>

<tr>
<td class="left">&#x2026;</td>
<td class="left">&#x2026;</td>
</tr>
</tbody>
</table>

<p>
<b>Server:</b> Ein Server ist eine Software, die bestimmte Dienste anbietet.
</p>

<p>
<b>Dienst</b>: s. <a href="./service.html">Dienst</a>
</p>

<p>
<b>Protokoll</b>: s. <a href="./protocol.html">Protokoll</a>
</p>

<p>
<b>triple play:</b> Dienste, die in Deutschland über die Telefonsteckdose
angeboten werden: Telefonie, Internetzugang, Fernsehen
</p>

<p>
<b>ISO</b>: International Organization for Standardization
</p>

<p>
<b>OSI</b>: Open System Interconnection
</p>

<p>
<b>ISDN</b>: Integrated Services Digital Network
</p>

<p>
<b>GSM</b>: Global System for Mobile Communication
</p>

<p>
<b>PSTN</b>: Public Switched Telephone Network
</p>

<p>
<b>TCP</b>: Tranmission Control Protocol
</p>

<p>
<b>UDP:</b> User Datagram Protocol
</p>

<p>
<b>Netzwerkarchitektur:</b> Ein System aus Schichten und Protokollen heißt
<i>Netzwerkarchitektur</i>. Das OSI-Referenzmodell ist eine
Netzwerkarchitektur.
</p>

<p>
<b>Protocol stack:</b> Die Liste von Protokollen (ein Protokoll pro
Schicht!), die von <i>einem</i> System genutzt wird nennt man <i>protocl
stack</i>.
</p>

<p>
<b>MAC</b>: Medium Access Control
</p>

<p>
<b>ICT</b>: Information and Communication Technology
</p>

<p>
<b>Routing</b>: Als <i>Routing</i> bezeichnet man das Finden einer optimalen Route
zum Transport von Paketen zwischen End-Systemen. Routing funktioniert
über die Erstelleung und kontinuierliche Aktualisierung der <b>routing
tables</b> mit <b>next hop</b> Einträgen in Transit- und Endsystemen.
</p>

<p>
<b>ISP:</b> Internet Service Provider
</p>

<p>
<b>Network Adress Translateion</b> (NAT): Network Adresstranslation findet
statt, wenn Pakete über Netzwerkgrenzen hinaus transportiert werden.
Z.B., wenn Pakete aus einem privaten Netzwerk (10.*.*.*) in ein
öffentliches Netzwerk transportiert werden. Systeme, die NAT
ausführen, werden im Allgmeinen als <i>Router</i> bezeichnet.
</p>

<p>
<b>Forwarding:</b> Forwarding bezeichnet das Weiterleiten von Paketen in
Transitsystemen mit Hilfe von <b>forwarding tables</b>
</p>

<p>
<b>Maximum Transmission Unit</b> (MTU): maximale Größe einer
 Übertragungseinheit (packet, frame, sequence, etc.)
</p>

<p>
<b>Internet Assigned Number Authority</b> (IANA): Die IANA verwaltete den
globalen Pool von IP-Adressen und AS Nummern und vergibt
IP-Adressblöcke an RIRs.
</p>

<p>
<b>Regional Internet Registrars</b> (RIRs): verwalten IP-Adressen und AS
Nummern in ihrer Region. Die RIRs sind: <i>AfriNIC</i> (Afrika), <i>APNIC</i>
(Asien/Pazifik), <i>ARIN</i> (Nordamerika), <i>LACNIC</i> (Lateinamerika, Karibik),
<i>RIPE NCC</i> (Europa).
</p>
</div>
</div>
